#/start
startCommand_1 = 'Привет, я был создан для переноса одного из стилей, выбранных Вами, на любую картинку, которую Вы мне предложите ;)'
startCommand_2 = 'Для выбора стиля нажмите на /style (или введите вручную)'
startCommand_3 = 'Для веселого эксперимента с собственным стилем нажмите на /fun (или введите вручную)'

#/style
style_0_text = '''Окей, давай посмотрим...
Введи 0, если сегодня выбор не твое ☺'''
style_0_photo = 'https://images-na.ssl-images-amazon.com/images/I/61xNiS1PIJL._SY355_.jpg'

style_1_text = 'Введи 1, если хочешь что-то такое:'
style_1_photo = 'https://4kwallpaper.org/wp-content/uploads/Modern-art-Wallpapers-28.jpg'

style_2_text = 'Введи 2, если желаешь это:'
style_2_photo = 'https://izfoamirana.su/wp-content/auploads/791531/vitrazh_tiffani_svoimi_rukami.jpg'

style_3_text = 'Введи 3, если твои мысли сходятся с этим:'
style_3_photo = 'http://4everstatic.com/bilder/zeichentrick/farbbilder,-frau-mit-dem-regenschirm-258702.jpg'

style_4_text = 'Введи 4, если мечтаешь о похожем результате:'
style_4_photo = 'https://media.wnyc.org/i/800/0/c/85/1/1023px-Francis_Picabia_1913_Udnie_Young_American_Girl_The_Dance.jpg'

style_5_text = 'Введи 5, если надеешься на такой же успех:'
style_5_photo = 'https://ae01.alicdn.com/kf/HTB1QYoNKpXXXXbdXXXXq6xXFXXX3/-.jpg'

style_6_text = 'Введи 6, если любишь футуризм всем сердцем:'
style_6_photo = 'http://www.avangardism.ru/img/pu/4pu.jpg'

style_7_text = 'Введи 7, если хочешь веселого эксперимента:'
style_7_photo = 'http://www.futurism.ru/a-z/zdanevichk/1.jpg'

style_8_text = 'Введи 8, если... Какого? Нет, не вводи! Аниме и реальная жизнь несовместимы!!'
style_8_photo = 'https://vsthemes.ru/uploads/posts/2018-08/1535719526_2018-08-31_155845.jpg'

style_9_text = '''PrInT 9, E҈̧̜̮̥͍̠̱͇͗̈͗̂̕ŗ̸̖̫͇͓̱̟̫̇͆͗͡ŗ̷̟͓̜͍̥̞͊̑̑̾͒̕ͅͅo̵̡̳͎̞͋̉̆̃̀͋͝r҈̡̗̝͛͗̒͞ͅ E̶̖̲̳͈̖̊̀̐̊͆̑̌̈́͢͠r҉̧̥̫͓̤͔̲͓̎̂́͋͗͗͝ŕ̷͔͚̰̠̠̲̗̎̏̀̀͂͢͝o҈̡̭͙̱̙̗͓̣͌̾͌̉̾͞r̵̡͍͈̰̟̊̅͞ E҉͎̪̮̬̮͓͕̍̊̎̈͆̕͜r̷̩͍̠̆̀͒͢͡ȑ̷̡̞̭̩̣͓͈̬̎̇͝o҈̧̦̘̯͓̬̀͑͡ͅr҉̡̥̤͓̝̝͍͒̍̀̿̾͝ͅ Ȩ̴̛̜̙̣̣͉̋̐̈́̓r̶̪̭̮̯͓͎͖̗̅̃̄͑̚͜͡ŗ̸̪̫̪̦̪̗҇̇̄̑͛̋̔ͅǒ̷̧̱͔̾͑̑̉̊̉̊̕r҈̪̰̰̽̿̈́̊̓̑͢͞ 
                                E҈̢͙̮̤͕̠̅̐̆̕r̴̢͍͎͖̪͇͕̊͂̀̏̓͊̾̆̕ͅr҉̨̗̯̣͎̪̪҇̿̇͛o̸̧̟̝̥̽̿̚͡r҉̨͖̯͓͚̘̓̍̍̄̏̾͝  E҈̯͈̐̔͌͢͝r̸̡̬̣̖̟҇͂͆̾r̴̡̭͓͓̩̗̒̏̾̈́̈̍͐͠ͅơ̶͉̙͚͉̝̮̩̘͋́̐̾̇͢r҉̨̪̦͎̖̥̲͓͒́͡   Ȩ̵̛̘̫̞̬̬̅́̓͒̂̚r̶̛̦̜͓̜̎̊͛̀͜r̸̨̖̰̯̍̈̀̍̊̀͂͐͡ơ̸̭̪͚͊̌͗͌͌̃͢ŗ̵͖̰̞̳̃̑̀̀̆̀̎̄͞'''
style_9_photo = 'https://steamuserimages-a.akamaihd.net/ugc/856096098871732485/9AE061717B44506050E8D1AA5BAD3E51BCAD1185/?imw=1024&imh=768&ima=fit&impolicy=Letterbox&imcolor=%23000000&letterbox=true'

#/fun
fun_1 = '''Хорошо, вижу ты решил поиграться со своим стилем )
Тогда перейдем прямо к делу, для начала отправь мне фотографию содержания картинки.
    !!! Не пиши никаких цифр, пожалуйста, а то это введет меня в сомнение!!!'''
fun_2 = '''...Сразу скажу, результат получится не в очень хорошем качестве и не очень быстро,потому что я не всесилен )
Если хотите быстро и качественно, то Вам в /style, но здесь Вас ждет собственный опыт со своим стилем, разве не здорово?
(Если вместо изображения проскакивают какие-то помехи, то Вы выбрали слишком разные по размеру изображения)'''
fun_3 = '''Первую картинку(контент) запомнил!
Теперь отправьте мне стиль и можем начинать.
(Если вы просто случайно отправили изображение /start Ваша палочка-выручалочка)'''
fun_go = 'Понеслась! В процессе работы я буду присылать Вам мое продвижение по стилизации картинки, чтобы вы не скучали )'
fun_done = '''Готово, мне все нравится!
Если Вам нет, то вот /bark, успокойтесь )))'''

# Ответ на числа и фразы:
## Ответ на числа от 1 до 8
answer_1_8 = """Оки-доки, стиль Вы выбрали, теперь загрузите мне фотографию, у которой хотите изменить стиль
        !!!Если Вы просто случайно написали цифру и тем самым выбрали стиль, не печальтесь, введите /start и по порядку пройдите все пункты для переноса стиля!!!
        P.S: Стиль можно и перевыбрать, последняя написанная Вами цифра и будет стилем ;)"""
## Ответ на число 9
photo_9 = 'https://static.zerochan.net/W.D..Gaster.full.2224130.png'
answer_9 = '''👎⚐ ✡⚐🕆 ❄☟✋☠😐 ✡⚐🕆 ✌☼☜ ✌👌⚐✞☜ ❄☟☜ 👍⚐☠💧☜✈🕆☜☠👍☜💧✍(Do you think you are above the consequences?)
☠⚐🕈 🕆🏱☹⚐✌👎 💣☜ ✌ 🏱☟⚐❄⚐...(now upload me a photo ...)'''
## Ответ на 0
answer_0_1 = 'Отлично, вы выбрали '
answer_0_2 = ''' стиль! С чем Вас и поздравляю, теперь загрузите мне фотографию.
        !!!Если Вы просто случайно написали цифру и тем самым выбрали стиль, не печальтесь, введите /start и по порядку пройдите все пункты для переноса стиля!!!
        P.S: Стиль можно и перевыбрать, последняя написанная Вами цифра и будет стилем ♣'''
## Ответ на неустановленную программой фразу пользователя
answer_other = """К сожалению общаться я не умею, так что я даже не могу понять послали вы меня или спасибо написали :)
      !!!А теперь перевыберите стиль (Ваше сообщение  сбросило выбор)!!!"""

# Фраза при применении стиля и отправки картинки:
send_magic_photo = "Минуточку, совершается волшебство..."
